import BeautifulCarousel from "../components/main/content/beautiful_carousel";
import ProductCarousel from "../components/main/content/product_carousel";
import "./home.css"
import { useState, useEffect } from "react";

function Home() {
    const [paintings, setPaintings] = useState([]);
    useEffect(() => {
        fetch('http://127.0.0.1:8000/api/paintings')
            .then(response => response.json())
            .then(json => setPaintings(json))
    }, []);
    return (<>
        <BeautifulCarousel />
        <h2 className="beautiful_content" style={{ textAlign: "center" }}>Продукти</h2>
        <ProductCarousel products={paintings} />
        <div className="history">
            <h2 className="beautiful_content">Хто ми є?</h2>
            <p>Картинографія - це магазин, де кожна картина розповідає свою історію і відкриває перед відвідувачами захоплюючий світ мистецтва та подорожей. Історія цього магазину почалася кілька років тому, коли два друзі, Леся і Макс, вирішили об'єднати свої захоплення мистецтвом і подорожами, створивши місце, де люди могли б відкрити красу світу через об'єктив художника.</p>
            <p>Ім'я "Картинографія" виникло з об'єднання слів "картина" і "картографія", що символізує об'єднання мистецтва та подорожей. Магазин розташований в історичному центрі міста, а сама будівля є арт-об'єктом, прикрашеною фресками відомого місцевого художника.</p>
            <p>Основним концептом Картинографії є те, що кожна картина є результатом подорожі художника. Клієнти можуть знайти тут різноманітні роботи, представляючи різні країни та культури. Наприклад, картина, на якій зображено закат в Санторіні, демонструє красу Греції через очі художника, який подорожував на острові. Картина з рибальськими човнами на Версільському озері відображає Францію з відповідним настроєм та стилем.</p>
            <p>Леся і Макс активно співпрацюють з місцевими та міжнародними художниками, запрошуючи їх розповісти про свої подорожі через мистецтво. Щомісяця в магазині проводять виставки, де художники діляться своїми історіями і виставляють свої останні роботи.</p>
            <p>Картинографія також пропонує майстер-класи та лекції з мистецтва та подорожей, де клієнти можуть навчитися різним технікам та отримати поради від професійних художників та подорожніків.</p>
            <p>Завдяки унікальному підходу та атмосфері Картинографії, магазин став популярним місцем для тих, хто цінує мистецтво та мріє про подорожі. Кожна картина у магазині - це не просто шматок полотна, а віконце в світ, яке залишає незабутні враження і надихає на подорожі та творчість.</p>
        </div>
    </>);
}

export default Home;